{"version":"1","records":[{"hierarchy":{"lvl1":"Reálne čísla a ich základné vlastnosti"},"type":"lvl1","url":"/node0003","position":0},{"hierarchy":{"lvl1":"Reálne čísla a ich základné vlastnosti"},"content":"Základné číselné množiny sú čitateľovi určite známe už zo strednej školy. Zavedieme preto len ich označenie:\n\nN- množina všetkých prirodzených čísel.\nPrirodzené čísla sú čísla  1,2,3,\\dots . Súčet a súčin prirodzených čísel je prirodzené číslo.\n\nZ- množina všetkých celých čísel.\nCelé čísla sú všetky čísla, ktoré môžeme vyjadriť ako rozdiel dvoch prirodzených čísel. Súčet, súčin a rozdiel celých čísel je celé číslo.\n\nQ- množina všetkých racionálnych čísel.\nRacionálne čísla sú všetky čísla, ktoré je možné vyjadriť ako podiel celého a prirodzeného čísla. Súčet, rozdiel, súčin a podiel racionálnych čísel (okrem delenia nulou) je racionálne číslo.\n\nI- množina všetkých iracionálnych čísel.\nIracionálne čísla sú čísla, ktoré možno vyjadriť v tvare nekonečného neperiodického desatinného zlomku. Napíklad: \\sqrt3, \\sqrt2, \\pi.\n\nR- množina všetkých reálnych čísel.\nZjednotenie množiny racionálnych a iracionálnych čísel tvorí množinu reálnych čísel.\n\nZ vyššie uvedeného vyplýva, že medzi jednotlivými číselnými množinami platí nasledujúci vzťah:\n\n{N}\\subset {\\bf Z}\\subset {\\bf Q}, \\ \\ {\\bf Q}\\cup {\\bf I}= {\\bf R}, \\ \\ {\\bf Q}\\cap {\\bf I}= \\emptyset\n\nMnožina všetkých reálnych čísel má tieto základné vlastnosti:\n\nJe usporiadaná: pre každé dve reálne čísla a,b platí práve jeden zo vzťahov:\n a=b, \\ \\ a<b, \\ \\ b<a.\n\nJe všade hustá: medzi dvoma ľubovoľnými rôznymi reálnymi číslami a,b, pre ktoré platí a<b, existuje aspoň jedno reálne číslo c, pre ktoré platí:  a< c< b .\n\nJe uzavretá vzhľadom na operácie súčtu, súčinu, rozdielu a podielu t.j. súčet, súčin, rozdiel a podiel reálnych čísel je reálne číslo.\nMnožinu R možno jednojednoznačne zobraziť na číselnej osi t.j. každému reálnemu číslu možno priradiť jediný bod na číselnej osi a naopak.","type":"content","url":"/node0003","position":1},{"hierarchy":{"lvl1":"Cvičenia"},"type":"lvl1","url":"/node0004","position":0},{"hierarchy":{"lvl1":"Cvičenia"},"content":"Na číselnej osi znázornite reálne čísla:\n\n 3;\\ \\pi;\\ -\\pi;\\ -1;\\ 1+\\sqrt2;\\ \\frac{5}{3};\\ 0,25;\\ -\\sqrt 3.\n\nKtoré z nasledujúcich čísel sú racionálne:\n\n\\sqrt{5} +0,\\overline{12};  \\sqrt{2}\\sqrt{8}; \\sqrt{3}(\\sqrt{3}+2); (1+\\sqrt{2})(1-\\sqrt{2});  0,12\\, .\\, 0,\\overline{12};  \\sqrt{\\frac{6}{18}}; \\sqrt{\\frac{27}{75}}.\n\nUsporiadajte dané trojice čísel:\n\n\\frac{22}{7}, \\pi, \\frac{355}{113}; \\ \\ \\frac{13}{15}, \\sqrt7, \\frac{16}{6};\n\n-\\sqrt 2, -1,41, -1,44; \\ \\ -\\frac{7}{3}, -2,34,-2,31. \n\nNapíšte kladné racionálne číslo menšie ako 0,000001 a kladné racionálne číslo menšie ako  0,000001 .\\sqrt{2}.\n\nZistite, či platia nerovnosti:\n\n3-\\sqrt 2 - \\frac{5}{3} >0;\n\n4-\\sqrt 3 -\\frac{7}{3} >0;\n\n\\pi -8+\\ln (2) >0.","type":"content","url":"/node0004","position":1},{"hierarchy":{"lvl1":"Komplexné čísla"},"type":"lvl1","url":"/node0005","position":0},{"hierarchy":{"lvl1":"Komplexné čísla"},"content":"Množinu C všetkých usporiadaných dvojíc  (a,b) , kde a\\in{\\bf R},\\ b\\in {\\bf R} nazývame množinou komplexných čísel, ak pre každé dva prvky  z_1 =(a,b), z_2=(c,d) z množiny C je definovaná rovnosť, sčítanie a násobenie takto:\n\n z_1=z_2 práve vtedy, keď  a=c,\\ b=d,\nz_1 +z_2 =(a+c,b+d),\nz_1 \\cdot z_2 =( ac-bd,ad+bc).\n\nPre sčítanie a násobenie kompexných čísel platí asociatívny a komutatívny zákon. Násobenie komplexných čísel je distributívne vzhľadom na sčítanie komplexných čísel.\n\nNech z=(a,b) je komplexné číslo. Potom číslo a\\in {\\bf R} nazývame reálnou časťou a číslo b\\in {\\bf R} imaginárnou časťou komplexného čísla z.\nOznačujeme ich takto:  a=\\hbox{Re}\\ z,\\ b=\\hbox{Im}\\ z.\n\nKomplexné číslo (a,0) stotožňujeme s reálnym číslom a :  (a,0)=a. Komplexné číslo (0,b), kde b\\neq0, nazývame rýdzoimaginárnym číslom. Číslo (0,1) nazývame imaginárnou jednotkou a označujeme ho (0,1) = \\hbox{i}. Komplexné číslo z=(a,b) píšeme aj v tvare:\n\nz=(a,b)=(a,0)+(0,b)= (a,0)+(b,0)\\cdot(0,1) = a+\\hbox{i}b.\n\nKomplexné číslo  a-\\hbox{i}b nazývame komplexne združeným ku komplexnému číslu  a+\\hbox{i}b. Absolútnou hodnotou alebo modulom komplexného čísla z=a+\\hbox{i}b nazývame číslo\n\n\\vert z\\vert= \\sqrt{a^2+b^2}.\n\nAk pre komplexné číslo z platí: \\vert z\\vert=1, nazývame ho komplexnou jednotkou. Každú komplexnú jednotku z možno písať v tvare:\n\nz= \\cos \\alpha + \\hbox{i} \\sin \\alpha,\n\nkde α je reálne číslo. Toto číslo označujeme aj \\hbox{e}^{{\\rm i}\\alpha} a platí:\n\nhbox{e}^{{\\rm i}\\alpha} = \\cos \\alpha + \\hbox{i} \\sin \\alpha.\n\nArgumentom komplexného čísla z=a+\\hbox{i}b , kde  z\\neq 0, nazývame číslo \\varphi = \\hbox{Arg}\\, z, pre ktoré platí:\n\nsin \\varphi =\\frac{b}{\\sqrt{a^2+b^2}},\\ \\ \\cos \\varphi = \\frac{a}{\\sqrt{a^2+b^2}}.\n\nAk z=0, tak Arg\\, z=2k\\pi, kde k je celé číslo. Ak pre číslo φ platí: -\\pi \\leq \\varphi \\leq \\pi, nazývame ho hlavnou hodnotou argumentu a ozančujeme ho arg\\,z.\nKaždé komplexné číslo z možno vyjadriť v goniometrickom tvare:\n\nz=\\vert z\\vert( \\cos \\varphi + \\hbox{i} \\sin \\varphi),\n\nkde \\varphi = \\hbox{arg}\\, z, alebo v exponenciálnom tvare:\n\nz= \\vert z\\vert \\hbox{e}^{{\\rm i} \\varphi},\n\nkde \\varphi = \\hbox{arg}\\, z.\n\nVeta 1.1   Pre číslo i platí:\n\n{i}^2=-1, \\ \\ \\hbox{i}^3 = -\\hbox{i}, \\ \\ \\hbox{i}^4 = 1.","type":"content","url":"/node0005","position":1},{"hierarchy":{"lvl1":"Číselné množiny"},"type":"lvl1","url":"/node0006","position":0},{"hierarchy":{"lvl1":"Číselné množiny"},"content":"Číselnou množinou nazývame takú množinu, ktorej všetky prvky sú čísla.\n\nMajme číselnú množinu X. Nech M je také číslo z X, že pre všetky  x \\in X platí x\\leq M. Číslo M nazývame maximum množiny X a označujeme ho  \\max X.\n\nNech m je také číslo z množiny X, že pre všetky  x \\in X platí m\\leq x. Číslo m nazývame minimum množiny X a označujeme ho  \\min X.\n\nKaždá konečná číselná množina má maximum a minimum.\n\nČíselná množina X sa nazýva zhora ohraničená, ak existuje také číslo B, že pre každé číslo  x \\in X platí  x \\leq B. Číselná množina X sa nazýva zdola ohraničená, ak existuje také číslo b, že pre každé číslo  x \\in X platí  b \\leq x. Číslo B nazývame horným ohraničením množiny X a číslo b nazývame dolným ohraničením množiny X. Množina ohraničená zdola aj zhora sa nazýva ohraničená. Najmenšie horné ohraničenie množiny X sa nazýva supremum množiny X a označujeme ho \\sup X. Najväčšie dolné ohraničenie množiny X sa nazýva infimum množiny X a označujeme ho \\inf X. Majú tieto vlastnosti:\n\nPre každé  x \\in X platí  \\sup X \\geq x,\\ \\inf X \\leq x \n\nPre každé \\varepsilon >0 existujú čísla x_1 \\in X a x_2 \\in X, pre ktoré platí\n\nx_1 \\geq \\sup X- \\varepsilon, \\ \\ x_2 \\leq \\inf X + \\varepsilon\n\nAk množina X je ohraničená zhora, tak má supremum. Ak množina X je ohraničená zdola, tak má infimum.\n\nAk \\sup X \\in X, tak \\sup X = \\max X. Ak \\inf X \\in X, tak \\inf X = \\min X.\n\nNech a,b sú reálne čísla a nech a<b. Množinu čísel x, pre ktoré platí:\n\na < x< b nazývame otvoreným intervalom a označujeme ho  (a,b) . Pre takýto interval platí: a=\\inf(a,b),\\ b=\\sup(a,b). Minimum a maximum neexistuje.\n\n a \\leq x \\leq b nazývame uzavretým intervalom a označujeme ho  \\langle a,b\\rangle . Platí:  a=\\min \\langle a,b\\rangle =\\inf\\langle a,b\\rangle, \\ b=\\max \\langle a,b\\rangle =\\sup\\langle a,b\\rangle.\n\n a < x \\leq b nazývame zľava otvoreným a sprava uzavretým intervalom a označujeme ho  (a,b\\rangle . Platí:  a=\\inf ( a,b\\rangle,\\ b=\\sup ( a,b\\rangle =\\max ( a,b\\rangle. Minimum neexistuje.\n\n a \\leq x< b nazývame zľava uzavretým a sprava otvoreným intervalom a označujeme ho  \\langle a,b). Platí:  a=\\min \\langle a,b )=\\inf \\langle a,b ),\\ b=\\sup \\langle a,b ). Maximum neexistuje.\n\nIntervalmi nazývame aj množiny všetkých čísel x určených nerovnosťami:\n\n a \\leq x , označujeme \\langle a, \\infty ) - zľava uzavretý interval od a do nekonečna. Platí:  a=\\min \\langle a,\\infty )=\\inf \\langle a,\\infty ). Maximum a supremum neexistuje.\n\n a < x, označujeme ( a, \\infty ) - zľava otvorený interval od a do nekonečna. Platí: a=\\inf (a,\\infty). Minimum, maximum a supremum neexistujú.\n\n x \\leq b, označujeme (- \\infty ,b\\rangle  - sprava uzavretý interval od mínus nekonečna po b. Platí: b=\\max (-\\infty ,b\\rangle  =\\sup (-\\infty ,b\\rangle. Minimum a infimum neexistujú.\n\n x < b, označujeme (- \\infty ,b) - sprava otvorený interval od mínus nekonečna po b. Platí: b=\\sup (-\\infty,b). Maximum, minimum a infimum neexistujú.\n\nMnožinu všetkých reálnych čísel môžeme označovať aj  (- \\infty , \\infty ).\nOkolím čísla a (bodu a) nazývame otvorený interval, ktorý číslo a obsahuje. Označujeme ho  O(a).\n\\varepsilon - okolie bodu a je interval (a -\\varepsilon, a+\\varepsilon), pričom \\varepsilon >0.\n\nPre riešenie nasledujúcich príkladov, kde budeme dokazovať, že nejaké číslo je infimom alebo supremom množiny, nám bude užitočná nasledujúca veta:\n\nVeta 1.2   Archimedova vlastnosť: Pre ľubovoľné reálne číslo a existuje také prirodzené číslo n, že platí: n> a.\n\nPríklad 1. Nájdime supremum, infimum, maximum a minimum množiny M=(-\\frac{1}{2},1\\rangle .\n\nRiešenie: Zo znázornenia danej množiny na číselnej osi usúdime, že supremum množiny je číslo 1 a infimum množiny M je číslo -\\frac{1}{2}. Ukážeme, že je to tak. Čísla x, ktoré tvoria množinu M, spĺňajú nerovnicu\n\\frac{1}{2} < x \\leq 1.  \t(1.1)\n\nZ toho vyplýva, že daná množina je ohraničená a číslo 1 je jedno z horných ohraničení, číslo -\\frac{1}{2} je jedno z dolných ohraničení. Ukážeme, že číslo 1 je najmenším horným ohraničením, t.j.  \\sup M =1. Musí preto spĺňať vlastnosti suprema:\n\n x\\leq 1 pre každé  x\\in M.\n\nKu každému \\varepsilon >0 existuje také číslo x_1 \\in M, pre ktoré platí  x_1 \\geq 1-\\varepsilon. Prvé tvrdenie vyplýva z nerovnosti (1.1). Druhé tvrdenie dokážeme tak, že ak za x_1 vezmeme číslo 1 \\in M, potom pre každé \\varepsilon >0 platí  x_1 =1 \\geq 1-\\varepsilon.\nPodobne dokazujeme, že \\inf M = -\\frac{1}{2}:\n\n-\\frac{1}{2} < x, pre všetky  x\\in M - vyplýva z nerovnosti (1.1).\n\nAk zvolíme  \\varepsilon \\geq \\frac{1}{2}, potom číslo  x_2 =0, tak platí  -\\frac{1}{2} +\\varepsilon \\geq 0 = x_2. Ak zvolíme  0 < \\varepsilon < \\frac{1}{2} , potom číslo  -\\frac{1}{2} +\\frac{\\varepsilon}{2} =x_2 je prvkom množiny M, pre ktorý platí  x_2 = -\\frac{1}{2} +\\frac{\\varepsilon}{2}< -\\frac{1}{2} +\\varepsilon. Z toho vyplýva že \\inf M = -\\frac{1}{2}. Číslo -\\frac{1}{2} nie je z množiny M, preto podľa vlastnosti 4 pre infimum množina M nemá minimum. Číslo 1=\\sup M je z množiny M a preto podľa vlastnosti 4 je číslo 1= \\max M. \\clubsuit\n\nPríklad 2. Nájdime supremum, infimum, maximum a minimum množiny M, kde M je množina všetkých čísel tvaru \\frac{n+4}{n+5}, kde n je prirodzené číslo.\n\nRiešenie: Vypočítame niekoľko prvkov tejto množiny:  \\frac{5}{6},\\ \\frac{6}{7},\\ \\frac{7}{8},\\ \\frac{8}{9} \\dots  Z toho usudzujeme, že  \\sup M =1 a \\inf M = \\frac{5}{6}. Dokážeme to.\nVlastnosť číslo 1 je skutočne splnená:\n\n \\frac{n+4}{n+5} <1 \n\nUkážeme druhú vlastnosť: Zvolíme \\varepsilon >0. Treba nájsť prvok x_1 z množiny M tak, aby platilo:  x_1 \\geq 1-\\varepsilon.\nKeďže x_1 je prvok z M, musí byť tvaru  \\frac{n_0+4}{n_0+5} pre nejaké n_0 \\in {\\bf N}. Potom musí platiť:\n\n\\begin{displaymath}\\frac{n_0+4}{n_0+5} \\geq 1-\\varepsilon, \\end{displaymath}\n\nz čoho po úprave dostávame\n\nn_0 \\geq \\frac{5(1-\\varepsilon)-4}{\\varepsilon} \n\nZ Archimedovej vlastnosti ale takéto n_0 vždy existuje pre ľubovoľné \\varepsilon. Tým je dokázaná aj druhá vlastnosť suprema, a preto 1 je naozaj supremom množiny M.\nPodobne dokážeme, že \\inf M = \\frac{5}{6}. Prvá vlastnosť: Z nerovnosti  n\\geq 1 vyplýva\n\n6n-5n \\geq 25-24\n\n(n+4) \\geq 5(n+5)\n\n\\frac{n+4}{n+5} \\geq \\frac{5}{6}\n\nDruhá vlastnosť: Pre každé \\varepsilon treba nájsť prvok  x_2 =\\frac{n_1+4}{n_1+5}, pre ktorý bude platiť:  \\frac{n_1+4}{n_1+5} \\leq \\frac{5}{6}+\\varepsilon. Stačí ale zvoliť n_1=1 a potom nerovnosť  \\frac{5}{6} \\leq \\frac{5}{6} +\\varepsilon platí pre ľubovoľné \\varepsilon >0. Preto \\inf M = \\frac{5}{6}.\nSupremum množiny M nepatrí do M, preto množina nemá maximum. Infimum množiny M je prvkom tejto množiny, a preto \\min M =\\frac{5}{6}. \\clubsuit","type":"content","url":"/node0006","position":1},{"hierarchy":{"lvl1":"Cvičenia"},"type":"lvl1","url":"/node0007","position":0},{"hierarchy":{"lvl1":"Cvičenia"},"content":"Znázornite nasledujúce intervaly na číselnej osi:\n\n \\langle -1,3);  (\\pi, \\infty);  (\\sqrt 5, 10\\rangle ;  ( -\\infty, -\\frac{3}{2}\\rangle .\n\nNájdite prieniky a zjednotenia intervalov:\n\na) \\langle  -1,3), \\langle 2, \\infty);\n\nb) \\langle  -5,3),  (-7, 1\\rangle, (-4,2);\n\nc) (-123, 0\\rangle, (\\sqrt{-123}, -1\\rangle;\n\nd) (-\\infty, 3\\rangle, (-8, 15).\n\na) \\langle  -1,3), \\langle 2, \\infty);    b) \\langle  -5,3),  (-7, 1\\rangle, (-4,2);\n\nc) (-123, 0\\rangle, (\\sqrt{-123}, -1\\rangle;    d) (-\\infty, 3\\rangle, (-8, 15).\n\nZnázornite na číselnej osi všetky x \\in {\\bf R} pre ktoré platí:\n\na) x< -4; d) x \\leq 3;  g) x \\geq -2;\n\nb) 0 \\leq x \\leq 3;   e) -1<x<3;  h) 2<x \\leq 5;\n\nc) -\\frac{7}{4} \\leq x \\leq -\\frac{3}{4}; f) -3 \\leq x < 2; i)-\\frac{1}{2} < x \\leq \\frac{3}{2}.\n\nNájdite maximum, minimum, supremum a infimum (ak existujú) nasledujúcich množín\n\na) M_1 množina všetkých celých záporných čísel;\n\nb) M_2 je interval (0,1);\n\nc) M_3 je interval  \\langle 0,1\\rangle ;\n\nd) M_4 je množina všetkých racionálnych čísel z intervalu \\langle \\sqrt 2,\\sqrt 3\\rangle ;\n\ne) M_5 je interval \\langle -1,\\infty).\n\nNájdite maximum, minimum, supremum a infimum množiny M, ktorej prvky sú čísla tvaru  1+\\frac{1}{n}, 1-\\frac{1}{n} , kde n je prirodzené číslo.\n\nNájdite maximum, minimum, supremum a infimum množiny M, ktorej prvky sú čísla tvaru  \\frac{n+2}{n+1} , kde n je prirodzené číslo.\n\nMnožina M sa skladá z čísel:  0,2; 0,22; 0,222;0,2222;\\dots. Nájdite jej supremum.","type":"content","url":"/node0007","position":1},{"hierarchy":{"lvl1":"Zobrazenie čísel v počítači."},"type":"lvl1","url":"/node0008","position":0},{"hierarchy":{"lvl1":"Zobrazenie čísel v počítači."},"content":"Realizácia technických výpočtov prebieha spravidla v obore reálnych čísel, ktoré, ako už vieme, predstavujú nekonečnú množinu. V súčasnosti si efektívnosť tejto práce nevieme bez výkonnej výpočtovej techniky ani predstaviť. V tejto súvislosti si ale treba uvedomiť, že množina čísel, s ktorými ľubovoľný počítač pracuje, môže byť síce veľká, ale vždy je konečná. Jej veľkosť určuje architektúra procesorovej jednotky počítača. V praktickej realizácii numerických výpočtov na počítači sa tento problém prejaví v konkrétnom softvérovom vybavení, na ktorom sa úloha realizuje. Môže to byť napríklad kompilátor nejakého programovacieho jazyka ( C, Pascal, ...) alebo už hotový užívateľský softvér ( DERIVE, MATHEMATICA, EXCEL, ...). Presnosť zobrazenia čísel je v takomto prípade daná výberom typu premennej (pri programovacích jazykoch) alebo sa dá vhodnou voľbou nastaviť na požadovaný počet desatinných miest. Akékoľvek zvyšovanie presnosti zobrazovania čísla je však obmedzené kapacitou pamäte počítača, pričom treba vziať do úvahy aj prácnosť a efektívnosť výpočtu. Každý kompilátor programovacieho jazyka má ošetrenú hornú a dolnú hranicu množiny celých čísel, s ktorými je schopný pracovať. Táto množina je spravidla dosť veľká, aby postačovala na bežné technické výpočty, ale napriek tomu je vždy ohraničená. Pokiaľ sa číslo mimo tejto množiny vyskytne vo výpočtoch, hovoríme o pretečení alebo podtečení.\nMnožinu všetkých čísel, ktoré sa dajú zobraziť v počítači, označíme M. Dôležitou vlastnosťou množiny M je, že táto množina nie je uzavretá vzhľadom na aritmetické operácie, to znamená, že výsledok nejakej operácie s číslami tejto množiny nemusí byť číslo z množiny M. Nech γ je zobrazenie množiny reálnych čísel do množiny M. Symbolom \\oplus označíme aritmetickú operáciu prevádzanú na počítači a symbolom + aritmetickú operáciu nad reálnymi číslami. Dá sa overiť, že pre väčšinu počítačov platí vzťah\n\nx \\oplus y = \\gamma( x+y ), \\hbox{ pre } x,y \\in M.\n\nPre aritmetické operácie v množine M vo všeobecnosti neplatí asociatívny a distributívny zákon. Jedným z dôsledkov neplatnosti týchto zákonov je fakt, že matematicky úplne ekvivalentné algoritmy môžu pri realizácii na počítači dávať rozdielne výsledky.\n\nPríklad 3. Úlohou je stanoviť výpočtom na počítači súčet\n\n\\sum_{n=1}^{10 000} \\frac{1}{n^2} \\ \\ \\ (\\ \\approx 1,644834).\n\nPri sčítaní čísel v prirodzenom poradí  ((1+\\frac{1}{4})+\\frac{1}{9})+ \\dots , dostaneme výsledok s chybou\n\nväčšou, ako keď ich sčítame v opačnom poradí\n\n\\ \\ ( ( \\frac{1}{10 000^2} +\\frac{1}{9 999^2} ) +\\frac{1}{9998^2} )+\\dots \n\npri tej istej presnosti zobrazenia čísel v počítači.\n\nV prvom prípade sa totiž od určitého n súčet už nemení. \\clubsuit\n\nVšeobecne pri sčítaní podobných súčtov, kde sa absolútna hodnota sčítancov líši o niekoľko rádov, platí, že pre dosiahnutie vyššej presnosti musíme sčitovať od členov s najmenšou absolútnou hodnotou k členom s najvyššou absolútnou hodnotou. V praxi však tento efekt nemusí mať vždy rozhodujúci význam.","type":"content","url":"/node0008","position":1},{"hierarchy":{"lvl1":"Zdroje chýb"},"type":"lvl1","url":"/node0009","position":0},{"hierarchy":{"lvl1":"Zdroje chýb"},"content":"Reálny technický problém môžeme vyriešiť napríklad experimentálne (meraním) alebo pomocou matematických prostriedkov. Pri matematickom riešení problému je na začiatku nutné najskôr sformulovať matematický model daného problému, teda matematickú úlohu. Pod touto úlohou rozumieme jednoznačný a zrozumiteľný funkčný vzťah medzi danými a hľadanými objektami. Pri vytváraní matematického modelu reálneho problému musíme vždy prikročiť k určitej idealizácii skutočnosti. Rozdiel riešenia idealizovaného problému a riešenia skutočného reálneho problému nazývame chybou matematického modelu. Z veľkosti tejto chyby môžeme spätne posúdiť vhodnosť alebo nevhodnosť zvoleného matematického modelu.\nPostup na získanie riešenia matematickej úlohy môže byť tiež rôzny. V tejto súvislosti hovoríme o exaktných, približných a numerických metódach. Numerik -- optimista si zvyčajne kladie otázku, aké presné sú vypočítané výsledky, kým numerik -- pesimista sa spytuje, akej chyby sme sa dopustili. Tieto dve otázky sú, samozrejme, o tom istom, pretože skutočne len veľmi zriedkavo dosiahneme presné riešenie s presnými dátami. Ak na riešenie matematickej úlohy použijeme metódu, ktorá nám neposkytne presné riešenie, potom chybu, ktorej sa dopustíme voláme chybou metódy. Príkladom takejto chyby môže byť chyba, ktorej sa dopustíme, ak za limitu nekonečnej postupnosti vezmeme niektorý jej člen s dostatočne veľkým indexom. Pomocou numerických metód sa daná matematická úloha prevedie na úlohu jednoduchšiu. Numerická úloha je jasný a zrozumiteľný popis funkčného vzťahu medzi konečným počtom vstupných a výstupných dát. Numerická úloha je teda taký matematický model reálneho problému, ktorý môže byť zrealizovaný na počítači. Rozdiel riešenia matematickej a numerickej úlohy nazývame chybou aproximácie. Ide tiež o prípad chyby metódy. Príkladom takýchto chýb sú:\n\nVýpočet elementárnej funkcie (napr. \\sin (x)) z prvých n členov jej nekonečného Taylorovho radu.\n\nAproximácia výpočtu určitého integrálu funkcie súčtom konečného počtu hodnôt (napr. lichobežníkové pravidlo).\n\nRiešenie diferenciálnej rovnice tým, že derivácie nahradíme ich aproximáciami (napr. diferenčnými podielmi).\n\nK posúdeniu presnosti výsledkov musíme ešte vziať do úvahy chyby vo vstupných dátach, ktoré sú dané jednak chybami merania dát a jednak sú spôsobené zobrazením vstupných údajov do množiny počítača. Príkladom takýchto chýb môžu byť napríklad nepresnosti v zadávaní fyzikálnych konštánt (tie sú ale spravidla zanedbateľné) alebo chyby v empirických hodnotách, ktoré môžu byť zdrojom vážnych chýb a treba ich starostlivo preskúmať. Keďže tieto empirické chyby bývajú obvykle náhodné, ich analytické vyšetrenie býva väčšinou dosť obtiažne.\nNakoniec sú to chyby zaokrúhľovacie, kde zahrňujeme všetky nepresnosti spôsobené realizáciou algoritmu v počítači, vrátane nepresného vykonávania aritmetických operácií. Podobne ako empirické chyby vo vstupných údajoch, aj zaokrúhľovacia chyba má náhodný charakter, a preto nie je ľahké ju vyšetriť.\nVo výpočtoch pri hľadaní riešenia sme často nútení nahradiť číslo x\n\njeho približnou hodnotou  \\bar x. Číslo  \\bar x potom nazývame aproximáciou čísla x a platí:\n\nPresné číslo = aproximácia + chyba\n\nPríklad 4.\n\n\\sqrt 2 = 1,414214 + \\hbox{ chyba}\n\n\\pi =3,1415926536+ \\hbox{ chyba}\n\n\\clubsuit\n\nTento rozdiel  x-\\bar x = \\Delta x  nazývame absolútnou chybou aproximácie  \\bar x. Číslo \\varepsilon (\\bar x) \\geq 0 , pre ktoré platí\n\n\\vert x-\\bar x \\vert \\leq \\varepsilon(\\bar x),\n\nnazývame odhadom absolútnej chyby.\nPresné číslo x sa nachádza v intervale\n\n\\bar x-\\varepsilon(\\bar x) \\leq x \\leq \\bar x +\\varepsilon(\\bar x) .\n\nČíslo\n\n\\frac{\\Delta x}{x} =\\frac{x-\\bar x}{x}, \\ \\ x\\neq 0,\n\nnazývame relatívnou chybou aproximácie  \\bar x. Relatívna chyba sa často uvádza v percentách. V praxi, najmä ak je presná hodnota neznáma, často namiesto nej v podiele používame jej aproximáciu\n\n\\frac{\\Delta x}{\\bar x} =\\frac{x-\\bar x}{\\bar x}, \\ \\ \\bar x\\neq 0. \t(1.2)\n\nPríklad 5. Bežná aproximácia  \\sqrt 2  je číslo  1,414. Potom relatívna chyba je\n\n\\frac{0,002}{1,414} =0,00014.\n\n\\clubsuit\n\nČíslo \\delta(\\bar x) , pre ktoré platí\n\n\\left\\vert \\frac{x-\\bar x}{x} \\right\\vert \\leq \\frac{\\varepsilon (\\bar x)} {\\vert x\\vert} = \\delta (\\bar x),\n\nnazývame odhadom relatívnej chyby.\nVzhľadom na vzťah (1.2) platí nasledujúci odhad:\n\n\\bar x (1-\\delta(\\bar x) ) \\leq x \\leq \\bar x (1+\\delta(\\bar x)) \n\nPríklad 6. Pre x = \\pi = 3,14159 \\dots, \\bar x = 3,14  je  \\Delta x = 0,00159 \\dots, \\varepsilon(\\bar x) = 2.10^{-3}. Ďalej\n\n\\frac{\\Delta x}{x} \\approx \\frac{\\Delta x}{\\bar x} \\ \\approx 0,0506 \\%.\n\n\\clubsuit\n\nPríklad 7. Uhol nameraný s pomocou teodolitu je v rozpätí  22^{\\circ } 20^{'} 30^{''} \\pm 30^{''}. Aká je relatívna chyba merania?\n\nRiešenie:\n\n\\frac{\\Delta x}{\\bar x} = \\frac{30^{''} }{22^{\\circ} 20^{'} 30^{''}} \\cdot 100 \\% = 0,004 \\% \n\n\\clubsuit\n\nPríklad 8. Obsah štvorca je  25,16\\ cm^2 s presnosťou do  0,01\\ cm^2. S akou relatívnou chybou môžeme určiť stranu štvorca?\n\nRiešenie: Hľadaná strana je  x= \\sqrt{25,16} . Relatívna chyba strany štvorca je\n\n\\frac{\\Delta x}{x} = \\frac{ \\sqrt{25,16+0,01}-\\sqrt{25,16}}{\\sqrt{25,16}} \\cong \\frac{1}{2}\\frac{0,01}{25,16} = 0,0002. \n\n\\clubsuit\n\nVeta 1.3   Nech sú čísla  x_1, x_2, \\dots, x_n  aproximáciami čísel  X_1,X_2, \\dots, X_n a také, že pre každú aproximáciu najväčšia možná chyba je E. Potom najväčšia možná chyba pre sumu  x_i, i=1,\\dots,n je n. E.","type":"content","url":"/node0009","position":1},{"hierarchy":{"lvl1":"Chyby aritmetických operácií."},"type":"lvl1","url":"/node0010","position":0},{"hierarchy":{"lvl1":"Chyby aritmetických operácií."},"content":"Budeme predpokladať, že vykonávame presné aritmetické operácie s nepresnými číslami, teda s aproximáciami. Ďalej budeme predpokladať, že poznáme chyby, resp. odhady chýb týchto aproximácií. Budeme vyšetrovať, s akou presnosťou sa dá stanoviť výsledok, teda aká je jeho chyba, resp. jej odhad. Nech\n\nx_i =\\bar x_i +\\Delta x_i, \\ \\ \\vert\\Delta x_i\\vert \\leq \\varepsilon _i \\quad \\hbox{ a } \\quad \\left\\vert \\frac{ \\Delta x_i}{x_i}\\right\\vert \\leq \\delta _i, \\ \\ i=1,2,\n\nkde  \\varepsilon _i resp.  \\delta _i je odhad absolútnej, resp. relatívnej aproximácie  \\bar x_i.\n\nAk je  \\bar u = \\bar x_1 + \\bar x_2  aproximácia súčtu  u=x_1+x_2, potom\n\nu=\\bar x_1+\\Delta x_1+\\bar x_2+\\Delta x_2 = \\bar u +\\Delta u,\n\nkde\n\n\\Delta u = \\Delta x_1 + \\Delta x_2,\n\na platí\n\n\\vert\\Delta u \\vert \\leq \\vert\\Delta x_1\\vert + \\vert\\Delta x_2\\vert \\leq \\varepsilon _1 + \\varepsilon _2.\n\nAk je  \\bar v = \\bar x_1 - \\bar x_2  aproximácia rozdielu  v=x_1-x_2, potom\n\n\\Delta v = \\Delta x_1 - \\Delta x_2,\n\na platí\n\n\\vert\\Delta v \\vert \\leq \\vert\\Delta x_1\\vert + \\vert\\Delta x_2\\vert \\leq \\varepsilon _1 + \\varepsilon _2.\n\nAk je  \\bar w = \\bar x_1 \\bar x_2  aproximácia súčinu  w=x_1 x_2, potom\n\nw=\\bar x_1 \\bar x_2 +\\bar x_1\\Delta x_2+\\bar x_2\\Delta x_1+ \\Delta x_1 \\Delta x_2 = \\bar w +\\Delta w,\n\npoložíme\n\n\\Delta w \\approx \\bar x_1\\Delta x_2 + \\bar x_2 \\Delta x_1,\n\n(člen  \\Delta x_1 \\Delta x_2  neuvažujeme), potom platí\n\n\\vert\\Delta w \\vert \\leq \\vert\\bar x_1\\vert\\varepsilon _1 + \\vert\\bar x_2\\vert \\varepsilon _2.\n\nAk je  \\bar z = \\bar x_1 / \\bar x_2  aproximácia podielu  z=x_1/ x_2, potom\n\nz=\\frac{\\bar x_1+\\Delta x_1}{ \\bar x_2+\\Delta x_2} = \\bar z +\\Delta z,\n\nkde\n\n\\Delta z=\\frac{\\bar x_2\\Delta x_1 - \\bar x_1 \\Delta x_2} {\\bar x_2^2},\n\na platí\n\n\\vert\\Delta z \\vert \\leq \\frac{\\vert\\bar x_2\\vert\\varepsilon _1 + \\vert\\bar x_1\\vert \\varepsilon _2}{\\vert\\bar x_2\\vert^2}.\n\nPre relatívne chyby môžeme z vyššie uvedených vzťahov odvodiť\n\n\\frac{\\Delta u}{u} \\approx \\frac{\\bar x_1}{ \\bar x_1+ \\bar x_2} \\frac{\\Delta x_1}{ x_1} +\\frac{\\bar x_2}{ \\bar x_1+ \\bar x_2} \\frac{\\Delta x_2}{ x_2},\n\n\\vert \\frac{ \\Delta u}{u} \\vert \\leq \\frac{1}{ \\vert \\bar x_1+ \\bar x_2 \\vert} ( \\vert\\bar x_1\\vert \\delta _1 +\\vert\\bar x_2\\vert \\delta_2).\n\n\\frac{\\Delta v}{v} \\approx \\frac{\\bar x_1}{ \\bar x_1- \\bar x_2} \\frac{\\Delta x_1}{ x_1} -\\frac{\\bar x_2}{ \\bar x_1- \\bar x_2} \\frac{\\Delta x_2}{ x_2},\n\n\\vert\\frac{\\Delta v}{v}\\vert \\leq \\frac{1}{ \\vert\\bar x_1-\\bar x_2 \\vert} ( \\vert\\bar x_1\\vert \\delta _1 +\\vert\\bar x_2\\vert \\delta_2).\n\nUpozorňujeme tu na fakt, že pri odčítaní blízkych čísel má na veľkosť relatívnej chyby rozdielu rozhodujúci význam číslo \\frac{1}{\\bar x_1-\\bar x_2}.\n\n\\frac{ \\Delta w}{w} \\approx \\frac{\\bar x_1 \\Delta x_2+ \\bar x_2 \\Delta x_1}{\\bar x_1 \\bar x_2}= \\frac{\\Delta x_2}{\\bar x_2}+ \\frac{\\Delta x_1}{ \\bar x_1},\n\n\\vert \\frac{\\Delta w}{w} \\vert \\leq \\delta _1 + \\delta_2.\n\n\\frac{\\Delta z}{z} \\approx \\frac{\\Delta x_1} { \\bar x_1}- \\frac{\\Delta x_2}{\\bar x_2},\n\n\\vert\\frac{\\Delta z}{z}\\vert \\leq \\delta _1 + \\delta_2.\n\nNech je x reálne číslo, ktoré má nekonečné dekadické vyjadrenie. Hovoríme, že číslo x^{(d)} , ktoré má d desatinných miest, je správne zaokrúhlenou hodnotou čísla x, ak je zaokrúhľovacia chyba \\varepsilon taká, že\n\n\\vert \\varepsilon \\vert = \\vert x - x^{(d)} \\vert \\leq \\frac{1}{2} \\cdot 10^{-d}\n\nPríklad 9. Nech  x= 6,7439966 \\dots, potom je  x^{(3)} =6,744 a x^{(7)} = 6,7439967. \\clubsuit\n\nAk je  \\bar x ľubovoľná aproximácie presnej hodnoty x, potom hovoríme, že k-te desatinné číslo je platné, ak platí:\n\n\\vert x- \\bar x\\vert \\leq \\frac{1}{2} \\cdot 10^{-k}.\n\nPri správne zaokrúhlenom čísle je teda každé miesto platné.\n\nPríklad 10. Nech je číslo  0,1492 správne na štyri desatinné čísla. Inými slovami, to znamená, že ide o aproximáciu skutočnej hodnoty, ktorá leží niekde v intervale medzi  0,14915  a 0,14925. V takomto prípade aproximácia má štyri platné číslice. Podobne číslo  14,92 má dve platné desatinné miesta a štyri platné číslice, za predpokladu, že jeho chyba neprevýši 0,005. \\clubsuit\n\nPríklad 11. Ak je  x = \\pi, \\bar x = 0,31415 \\cdot 10^1, potom\n\n\\vert\\frac{x-\\bar x}{x}\\vert \\leq 3 \\cdot 10^{-5} \\leq 0,5 \\cdot 10^{-4},\n\n\\vert x-\\bar x\\vert \\leq 10^{-4} \\leq 0,5 \\cdot 10^{-3}.\n\nV tomto prípade má  \\bar x len štyri platné číslice a aproximácia 3,1415 má tri platné desatinné miesta. \\clubsuit\n\nAk je počet platných číslic  n>1, potom za limitnú relatívnu chybu aproximácie  \\bar x s prvou platnou cifrou k možno vziať číslo\n\n\\delta = \\frac{1}{2k} \\left( \\frac{1}{10} \\right)^{n-1}.\n\nAk pre odhad relatívnej chyby δ platí\n\n\\delta \\leq \\frac{1}{2(k+1)} \\left(\\frac{1}{10}\\right)^{n-1},\n\npotom číslo  \\bar x má n platných číslic. Na uvedenom príklade vidíme súvislosť medzi počtom platných číslic a relatívnou chybou aproximácie: zväčšovanie chyby sa prejaví stratou platných číslic a obrátene. Preto sa vo výpočtoch vyhýbame rozdielom blízkych čísel, pri ktorých práve ku tejto strate platných čísel dochádza.\n\nPríklad 12. Koľko platných číslic má číslo A= 3,7563 ak relatívna chyba je 1\\%?\n\nRiešenie: Prvá platná číslica je 3 a keďže relatívna chyba je  0,01, potom platí\n\n0,01 \\leq \\frac{1}{2 \\cdot 4} \\left(\\frac{1}{10}\\right)^{n-1},\n\nodkiaľ n=2. Preto číslo A má dve platné číslice. A môžeme zapísať v tvare A = 3,8. \\clubsuit\n\nPríklad 13. Nech\n\nx_1 = 0,5010278, \\ \\ \\bar x_1 = 0,5010,\n\nx_2 = 0,5007812, \\ \\ \\bar x_2 = 0,5008,\n\npotom\n\n\\vert \\Delta x_1\\vert = 0,278 \\cdot 10^{-4} \\leq 0,5 \\cdot 10^{-4},\n\n\\vert\\frac{\\Delta x_1}{x_1}\\vert \\leq 0,5 \\cdot 10^{-3},\n\n\\vert \\Delta x_2\\vert = 0,188 \\cdot 10^{-4} \\leq 0,5 \\cdot 10^{-4},\n\n\\vert\\frac{\\Delta x_2}{x_2}\\vert \\leq 0,5 \\cdot 10^{-4}.\n\nVypočítame rozdiel uvedených čísel:\n\nv =x_1-x_2 =0,2466 \\cdot 10^{-3},\\ \\bar v = \\bar x_1 -\\bar x_2 = 0,2 \\cdot 10^{-3},\n\n\\vert\\Delta v \\vert \\leq 0,5 \\cdot 10^{-4}.\n\n\\vert\\frac{\\Delta v}{v} \\vert \\leq 1,9 \\cdot 10^{-1}.\n\nVýstupná relatívna chyba je teda v porovnaní s relatívnymi chybami vstupných údajov omnoho väčšia. \\clubsuit\n\nPríklad 14. Je daná kvadratická rovnica\n\nx^2 -56 x +1 =0\n\ns koreňmi  x_1=28+\\sqrt{783} a  x_2 = 28-\\sqrt{783}. Ak vypočítame \\sqrt{783} na päť platných číslic (t.j. s chybou menšou ako 0,5 \\cdot 10^{-3}, \\sqrt{783} = 27,982), máme: x_1= 55,982, x_2 = 0,018. Absolútna chyba koreňov nie je väčšia ako 0,0005. Ale pre relatívnu chybu platí:\n\n\\vert\\frac{\\Delta x_1}{x_1}\\vert \\leq 0,5 \\cdot 10^{-5}; \\ \\ \\vert\\frac{\\Delta x_2}{x_2}\\vert \\leq 0,8 \\cdot 10^{-2}.\n\nKoreň x_1 je určený na päť platných číslic a koreň x_2 len na dve platné číslice. Ak chceme aj druhý koreň vypočítať presnejšie, máme dve možnosti:\n\nvypočítať \\sqrt{783} na desať platných číslic, čo je náročnejšie na pamäť počítača aj na čas.\n\nKoreň x_2 vypočítať iným algoritmom, čo predpokladá, že taký algoritmus poznáme; napríklad z vlastnosti koreňov pre túto rovnicu totiž platí:\n\nx_1 \\cdot x_2 =1. Preto:\n\nx_2 =\\frac{1}{x_1} =\\frac{1}{55,982}=0,01786288.\n\n\\clubsuit","type":"content","url":"/node0010","position":1},{"hierarchy":{"lvl1":"Cvičenia"},"type":"lvl1","url":"/node0011","position":0},{"hierarchy":{"lvl1":"Cvičenia"},"content":"Vypočítajte plochu obdĺžnika so stranami  92,73 \\pm 0,01 metrov a  94,5 \\pm 0,01 metrov. Vypočítajte relatívnu chybu výsledku a počet platných číslic.\n\nNájdite odhad relatívnej chyby výpočtu povrchu zrezaného kužeľa, ak jeho polomery majú veľkosť  R=23,64 \\pm 0,01 \\hbox {cm},\\ r= 17,31 \\pm 0,01 \\hbox{cm}, jeho výška je l=10,21 \\pm 0,01 \\hbox{cm} a  \\pi =3,14.","type":"content","url":"/node0011","position":1},{"hierarchy":{"lvl1":"Úlohy a algoritmy"},"type":"lvl1","url":"/node0012","position":0},{"hierarchy":{"lvl1":"Úlohy a algoritmy"},"content":"Medzi matematickými a aj numerickými úlohami sa stretávame aj s takými, ktorých riešenia sú veľmi citlivé na zmeny vo vstupných údajoch. Znamená to, že aj malé zmeny vo vstupných údajoch spôsobia veľké zmeny v riešeniach. Je preto užitočné rozdeliť matematické úlohy z hľadiska tejto “citlivosti” na dve skupiny.\nÚloha, ktorá má nasledujúce vlastnosti\n\nmá jediné riešenie\n\ntoto riešenie spojite závisí na vstupných údajoch,\n\nsa nazýva korektná úloha.\nTento pojem sme z matematického hľadiska nedefinovali veľmi presne, pretože nie je povedané, čo je to “spojite závisí”. Na exaktné vysvetlenie tohoto pojmu by boli potrebné aspoň minimálne znalosti z teórie funkcionálnych priestorov a tie presahujú obsah tejto publikácie. Voľne povedané, ak množinu vstupných údajov vyberáme z nejakého okolia “skutočných” vstupov (dopustíme sa napríklad chyby pri meraní), potom množina výstupných údajov bude z nejakého okolia “skutočného” riešenia úlohy. Toto okolie však môže byť dosť “veľké”.\nVeľkú triedu nekorektných úloh tvoria nejednoznačné úlohy. Nekorektnosť úlohy býva často zapríčinená aj jej nekorektnou formuláciou.\nZaujíma nás teraz “veľkosť” okolia výstupných údajov z druhej vlastnosti.\nHovoríme, že úloha je dobre podmienená, ak malé zmeny vo vstupných údajoch vyvolajú len malé zmeny vo výstupných údajoch (riešení). Ak máme dvojicu vstupných dát x a  x+\\triangle x a im odpovedajúce výstupné dáta sú y a y+\\triangle y, potom číslo\n\nC_p = \\frac{\\frac{\\vert\\vert \\triangle y \\vert\\vert}{\\vert\\vert y \\vert\\vert}}{\\frac{\\vert\\vert \\triangle x \\vert\\vert}{\\vert\\vert x \\vert\\vert}}\n\nnazývame číslo podmienenosti úlohy. V tomto vzťahu výraz \\vert\\vert.\\vert\\vert znamená normu v nejakom vhodnom priestore. Napríklad, ak je vstup aj výstup reálne číslo, je to absolútna hodnota tohoto čísla, v prípade, že ide o vektory, jedná sa o normu príslušných vektorov (pojem absolútna hodnota pozri časť 1.8).\n\nV praxi väčšinou nevieme stanoviť presne toto číslo, iba jeho odhad. Ak je odhad čísla C_p \\approx 1, hovoríme o (veľmi) dobre podmienených úlohách. Pre veľké hodnoty C_p hovoríme o zle podmienených úlohách.\n\nPovieme si teraz niečo o postupoch, ktorými úlohy riešime. Algoritmom numerickej metódy rozumieme jasný a jednoznačný popis konečnej postupnosti operácií, pomocou ktorých m-tici čísel z určitej množiny vstupných dát jednoznačne priradí n-ticu výstupných dát (výsledkov). Operáciami rozumieme aritmetické a logické operácie, ktoré môže vykonávať počítač.\nPri realizácii konkrétneho numerického algoritmu na počítači sa dopúšťame chýb v aritmetických operáciách. Tieto chyby sa objavia vždy, aj keby boli vstupné údaje presné. Preto vzniká problém, ako posúdiť citlivosť každého konkrétneho algoritmu na zaokrúhľovacie chyby včítane chýb vo vstupných údajoch. Ak sa chceme vyvarovať nezmyselných výsledkov, musíme si vyberať algoritmy málo citlivé na tieto chyby. Takéto algoritmy budeme nazývať stabilné.\n\nMedzi známymi numerickými algoritmami významnú úlohu majú tzv. iteračné procesy. Používame ich spravidla vtedy, keď potrebujeme stanoviť limitnú hodnotu vhodne zvolenej postupnosti medzivýsledkov. Spravidla ich popisuje iteračná formula, t.j. pravidlo, ako pomocou jedného (1-krokový iteračný proces) alebo viacerých (viackrokový iteračný proces) predchádzajúcich medzivýsledkov možno vypočítať nasledujúci medzivýsledok. Jednokrokový iteračný proces môžeme zapísať formulou typu\n\nx_n =F(x_{n-1}),\\ \\ n=1,2,3,\\dots.\n\nK zahájeniu tohoto iteračného procesu potrebujeme poznať len jednu hodnotu (napríklad x_0) a postupne vypočítame\n\nx_1=F(x_0),\\ x_2=F(x_1),\\dots , x_k=F(x_{k-1}),\\dots.\n\nČleny postupnosti  \\{ x_0,x_1,x_2,\\dots\\} nazývame iteráciami alebo postupnými aproximáciami. Pretože žiadny algoritmus nemôže obsahovať nekonečne veľa krokov, musíme proces určený iteračnou formulou pre nejaké  n= N  ukončiť. Potom  x_N bude len približnou hodnotou (aproximáciou). Číslo N spravidla nevyberáme dopredu, ale určujeme takzvanú zastavovaciu podmienku. Táto podmienka obyčajne znie: Pokračuj vo výpočte podľa iteračnej formuly, pokiaľ bude\n\n\\vert x_k-x_{k-1}\\vert \\geq \\delta,\n\nkde δ je nejaké vopred zvolené (malé) číslo.\nAk sa dá iteračný proces zapísať iteračnou formulou typu\n\nx_{n+p} =F(x_n, x_{n+1},\\dots,x_{n+p-1}),\\ n=0,1,2,\\dots,\n\nhovoríme o p-krokovom iteračnom procese. K zahájeniu výpočtu potrebujem poznať p hodnôt, napríklad  x_0, x_1,\\dots, x_{p-1} .","type":"content","url":"/node0012","position":1},{"hierarchy":{"lvl1":"Nerovnice"},"type":"lvl1","url":"/node0013","position":0},{"hierarchy":{"lvl1":"Nerovnice"},"content":"Pre prácu s nerovnosťami a nerovnicami platia tieto základné vlastnosti:\n\nAk a<b a  b<c, potom  a<c (tranzitívnosť).\n\nAk a<b a c je ľubovoľné, potom  a+c < b+c.\n\nAk a<b a c<d, potom a+c<b+d.\n\nAk a<b a  m>0, potom am<bm; ak a<b a  m<0, potom am>bm.\n\nAk a<b a c<d , kde a,b,c,d sú kladné čísla, potom  ac<bd.\n\nAk  0<ab , potom je 0<a, 0<b, alebo a<0, b<0.\n\nAk ab<0 , potom je 0<a, b<0, alebo a<0, 0<b.\n\nAk 0<b,  \\ -b <a<b , potom je a^2 <b^2. Ak 0<b, a^2<b^2, je  \\ -b <a<b .\n\nAk je 0<a a a^2 <b^2, potom platí: alebo  0<a<b alebo b<-a <0.\n\nTieto vlastnosti ostanú v platnosti aj keď znak < nahradíme znakom  \\leq.\nLineárna nerovnica s jednou neznámou x má tvar:\na x + b\\ N \\ 0,\t(1.3)\n\nkde  a \\neq 0, b  sú reálne čísla a N je niektorý zo znakov  <,>, \\leq, \\geq, \\neq .\nKvadratická nerovnica s jednou neznámou je nerovnica tvaru:\na x^2 + bx +c\\ N\\ 0 \t(1.4)\n\nkde  a\\neq 0 a N je opäť niektorý zo znakov  <,>, \\leq, \\geq, \\neq .\nRiešením nerovnice (1.3) alebo (1.4) nazývame množinu všetkých čísel, ktoré keď dosadíme do nerovnice namiesto neznámej x dostaneme pravdivú nerovnosť medzi číslami.\nSystém lineárnych nerovníc s jednou neznámou má tvar\n\\displaystyle a_1 x+b_1 \\ N \\ 0 \t  \t  \t\n\\displaystyle a_2 x+b_2 \\ N \\ 0 \t  \t  \t\n\\displaystyle \\vdots \t  \t  \t(1.5)\n\\displaystyle a_n x +b_n \\ N \\ 0,\n\nkde  a_1, a_2, \\dots, a_n sú rôzne od nuly.\nNech riešenia jednotlivých nerovníc systému (1.5) sú  M_1, M_2, \\dots, M_n. Potom riešenie systému (1.5) je  M = M_1 \\cap M_2 \\cap \\dots \\cap M_n.\nEkvivalentnými nerovnicami nazývame také nerovnice, ktorých množiny riešení sú rovnaké množiny. Úpravy, pomocou ktorých z danej nerovnice dostaneme ekvivalentnú, nazývame ekvivalentnými úpravami.\nPri riešení nerovníc používame vlastnosti 1.-9. a to tak, že z danej nerovnice dostávame ekvivalentné nerovnice, ktoré už vieme riešiť.\nKvadratickú nerovnicu (1.4) možno riešiť úpravou na tvar\n\\begin{displaymath} ( x+\\frac{b}{2a})^2 \\ N \\ \\frac{b^2-4ac}{4a^2}. \\end{displaymath} \t(1.6)\n\nPri riešení tejto nerovnice môžu nastať tieto tri prípady:\n\nD=b^2-4ac >0 , nerovnicu (1.6) môžeme riešiť napríklad úpravou na tvar\n\n\\begin{displaymath}a(x-\\alpha)(x-\\beta) \\ N \\ 0, \\end{displaymath}\n\nkde \\alpha, \\beta sú korene rovnice  ax^2 +bx+c =0 . Nerovnicu riešime ďalej podľa vlastností 5. a 6.\n\nD=b^2-4ac=0 . Potom nerovnica (1.6) nemá riešenie, ak N značí <; nerovnica (1.6) má riešenie  (- \\infty , \\infty ) , ak N značí  \\geq; nerovnica (1.6) má riešenie  x=-\\frac{b}{2a}, ak N značí  \\leq; nerovnica (1.6) má riešenie všetky reálne čísla okrem čísla -\\frac{b}{2a}, ak N značí ≠ alebo >.\n\nD=b^2 -4ac <0. Potom nerovnica (1.6) nemá riešenie, ak N značí < alebo  \\leq; nerovnica (1.6) má riešenie  (- \\infty , \\infty ) , ak N značí >, \\geq alebo ≠.\n\nPríklad 15. Riešme nerovnicu:\n\n\\frac{3-x}{5} < \\frac{2x-8}{3} -\\frac{3x-1}{2}\n\nRiešenie: Podľa vlastnosti 4. dostaneme po vynásobení oboch strán nerovnice číslom 30 ekvivalentnú nerovnicu:\n\n18-6x < 20x-80 -45x +15,\n\nodkiaľ\n\n18-6x < -25x -65.\n\nK obom stranám nerovnice pripočítame výraz  25x-18 a podľa vlastnosti 2. dostaneme\n\n19x < -83.\n\nVynásobením tejto nerovnice číslom  \\frac{1}{19} dostaneme\n\nx< -\\frac{83}{19} .\n\nRiešením tejto nerovnice sú čísla z intervalu  (-\\infty , -\\frac{83}{19} ). Pri riešení sme robili len ekvivalentné úpravy, preto nájdené riešenie je aj riešením pôvodnej nerovnice. \\clubsuit\n\nPríklad 16. Riešme nerovnicu:\n\nx^2-5x+6 <0. \n\nRiešenie: Pretože D=(-5)^2 -4 \\cdot 6 =1 >0 , danú nerovnicu riešime tak, že trojčlen  x^2-5x+6 rozložíme na súčin koreňových činiteľov. Korene kvadratickej rovnice  x^2-5x+6=0 sú čísla  2 a 3. Preto platí  x^2-5x+6= (x-3)(x-2). Dostávame\n\n(x-3)(x-2) <0.\n\nTáto nerovnica je podľa vlastnosti 7. ekvivalentná s jedným z nasledujúcich dvoch systémov\n\\displaystyle x-3 >0, \\ \\ x-2 <0 \t  \t  \t(1.7)\n\\displaystyle \\hbox{ alebo } \t  \t  \t\n\\displaystyle x-3<0, \\ \\ x-2 >0 \t  \t  \t(1.8)\n\nRiešením systému (1.7) je prienik  (-\\infty,2) \\cap ( 3,\\infty) = \\emptyset. Riešením systému (1.8) je prienik (-\\infty,3) \\cap (2,\\infty ) = (2,3). Riešením pôvodnej nerovnice preto je  \\emptyset \\cup (2,3)= (2,3). \\clubsuit","type":"content","url":"/node0013","position":1},{"hierarchy":{"lvl1":"Cvičenia"},"type":"lvl1","url":"/node0014","position":0},{"hierarchy":{"lvl1":"Cvičenia"},"content":"Riešte nerovnice:\n\na) \\frac{12-x}{x-4} > 0;  d) \\frac{x+1}{x+3} < \\frac{x+5}{x+6};\n\nb) \\frac{5-2x}{x-7} \\geq 3;   e) \\frac{x(x+1)}{(x-1)(x-2)} \\geq 0;\n\nc) \\frac{(x+2)(x-3)}{x(x-4)} \\leq 0; f) \\frac{x+1}{x-2,5} \\leq 2.\n\nRiešte nerovnice:\n\n\\begin{displaymath} \\begin{array}{ll} \\hbox{a)} \\ x^2 -2x+5 <0; \\ \\ \\ & \\hbox{d)... ...2x^2 -3x -2 \\geq 0; & \\hbox{f)} \\ 8x^2 -23 \\leq 0. \\end{array}\\end{displaymath}\n\na) x^2 -2x +5 <0;  d) 2x^2 - 2x <0;\n\nb) x^2 +14x -24 <0;   e) 6x^2 +13x +6 <0;\n\nc) 2x^2 -3x -2 \\geq 0; f) 8x^2 - 23 \\leq 0.","type":"content","url":"/node0014","position":1},{"hierarchy":{"lvl1":"Absolútna hodnota reálneho čísla"},"type":"lvl1","url":"/node0015","position":0},{"hierarchy":{"lvl1":"Absolútna hodnota reálneho čísla"},"content":"Nech a\\in {\\bf R}. Absolútnu hodnotu čísla a označujeme \\vert a\\vert  a rozumieme ňou číslo\n\n\\vert a\\vert =a, \\hbox{ ak } a \\geq 0;\n\n\\vert a\\vert = -a, \\hbox{ ak } a<0. \n\nNech a,b sú reálne čísla. Potom platí:\n\n\\vert a\\vert = \\max \\{ a, -a\\}\n\n\\vert a\\vert = \\vert-a\\vert\n\na \\leq \\vert a\\vert \n\n\\vert a\\vert = \\sqrt{ a^2} \n\n\\vert ab\\vert = \\vert a\\vert \\vert b\\vert\n\n\\vert a^n\\vert = \\vert a\\vert^n , pre každé prirodzené číslo n\n\n\\vert \\frac{a}{b}\\vert =\\frac{\\vert a\\vert}{\\vert b\\vert}\\ \\ ( b \\neq 0)\n\n\\vert a+b\\vert \\leq \\vert a\\vert+ \\vert b\\vert  (trojuholníková nerovnosť)\n\n\\vert a\\vert -\\vert b\\vert \\leq \\vert a \\pm b\\vert \\leq \\vert a\\vert+\\vert b\\vert \n\nGeometrický význam absolútnej hodnoty reálneho čísla a je vzdialenosť obrazu čísla a na číselnej osi od začiatku. Vzdialenosť bodu a od bodu b na číselnej osi je preto  \\vert b-a\\vert.\n\nPríklad 17. Riešme rovnicu:\n\n\\vert x+3\\vert =\\frac{1}{5}. \n\nRiešenie: Najskôr rovnicu upravíme tak, aby neobsahovala absolútnu hodnotu. Uvažujeme dva prípady:\na)  x+3 \\geq 0, potom  \\vert x+3\\vert =x+3 a daná rovnica je ekvivalentná so systémom\n\\displaystyle x+3 \\geq 0 \t  \t  \t(1.9)\n\\displaystyle x+3 = \\frac{1}{5}. \t  \t  \t(1.10)\n\nRiešením nerovnice (1.9) je interval  \\langle -3,\\infty). Riešením rovnice (1.10) je číslo  x=-\\frac{14}{5}. Preto riešením systému (1.9), (1.10) je prienik týchto množín:  \\langle -3,\\infty) \\cap \\{ -\\frac{14}{5} \\} = \\{ -\\frac{14}{5} \\}.\nb) x+3 <0 , potom  \\vert x+3\\vert =-(x+3) a daná rovnica je ekvivalentná so systémom\n\\displaystyle x+3 < 0 \t  \t  \t(1.11)\n\\displaystyle -(x+3) = \\frac{1}{5}. \t  \t  \t(1.12)\n\nRiešením nerovnice (1.11) je interval  (-\\infty,-3). Riešením rovnice (1.12) je číslo  x=-\\frac{16}{5}. Preto riešením systému (1.11), (1.12) je prienik týchto množín:  (-\\infty,-3) \\cap \\{ -\\frac{16}{5} \\} = \\{ -\\frac{16}{5} \\}.\nRiešením danej rovnice sú teda čísla  -\\frac{14}{5}, -\\frac{16}{5}. \\clubsuit\n\nPríklad 18. Riešme nerovnicu:\n \\vert x+1\\vert < \\vert x+3\\vert  \t(1.13)\n\nRiešenie: Keďže množina všetkých riešení je podmnožinou reálnych čísel, budeme uvažovať všetky možné prípady, ktoré môžu nastať. Sú to tieto štyri:\n\n\\hbox{a) }x+1 \\geq 0 \\hbox{ a } x+3 \\geq 0 ,\n\n\\hbox{b) }x+1 < 0 \\hbox{ a } x+3 < 0 ,\n\n\\hbox{c) }x+1 \\geq 0 \\hbox{ a } x+3 < 0 ,\n\n\\hbox{d) }x+1 < 0 \\hbox{ a } x+3 \\geq 0 .\n\npre prípad a) platí:  \\vert x+1 \\vert =x+1, \\ \\vert x+3\\vert=x+3. Nerovnica (1.13) je ekvivalentná so systémom nerovníc\n\nx+1 \\geq 0 \n\nx+3 \\geq 0 \n\nx+1 < x+3. \n\nRiešením tohoto systému sú všetky čísla x, pre ktoré platí súčasne  x \\geq -1, x \\geq -3 (tretia nerovnica je splnená pre ľubovoľné reálne číslo). Riešením je teda prienik intervalov  \\langle -1, \\infty) \\cap \\langle -3, \\infty) = \\langle -1, \\infty).\nV prípade b) platí:  \\vert x+1\\vert =-(x+1), \\ \\vert x+3 \\vert = -(x+3). Nerovnica (1.13) je ekvivalentná so systémom nerovníc\n\nx+1 < 0 \n\nx+3 < 0 \n\n-(x+1) <-( x+3). \n\nčiže\n\nx<-1 , \\ x< -3,\\ -1 < -3.\n\nKeďže riešením poslednej nerovnice je  \\emptyset, celý uvedený systém nemá riešenie.\nV prípade c) platí:  \\vert x+1\\vert =x+1, \\ \\vert x+3\\vert = -(x+3). Nerovnica (1.13) je ekvivalentná so systémom\n\nx+1 \\geq 0 \n\nx+3 < 0 \n\nx+1 <-( x+3). \n\nRiešením tohoto systému sú všetky čísla x, pre ktoré platia súčasne všetky tri nerovnice:  x \\geq -1,\\ x<-3, x<-2; to jest prienik intervalov \\langle -1,\\infty)\\cap (-\\infty,-3) \\cap (-\\infty, -2) =\\emptyset. V tomto prípade teda systém nemá riešenie.\nV prípade d) platí:  \\vert x+1\\vert =-(x+1), \\ \\vert x+3\\vert = x+3. Nerovnica (1.13) je ekvivalentná so systémom\n\nx+1 < 0 \n\nx+3 \\geq 0 \n\n-(x+1) < x+3. \n\nRiešením tohoto systému sú všetky čísla x, pre ktoré súčasne platí:  x < -1,\\ x \\geq -3, x>-2; to jest prienik intervalov (-\\infty,-1) \\cap \\langle -3,\\infty) \\cap (-2,\\infty) =(-2,-1). Riešením nerovnice (1.13) je zjednotenie intervalov \\langle -1, \\infty)\\cup(-2,-1)= (-2, \\infty). \\clubsuit","type":"content","url":"/node0015","position":1},{"hierarchy":{"lvl1":"Cvičenia"},"type":"lvl1","url":"/node0016","position":0},{"hierarchy":{"lvl1":"Cvičenia"},"content":"Vypočítajte:\n \\vert-5\\vert,\\ \\vert 24\\vert,\\ \\vert\\pi -1\\vert,\\ \\vert 1-2\\sqrt2\\vert,\\ \\vert 2-\\sqrt4\\vert.\n\nZnázornite na číselnej osi množiny všetkých x \\in {\\bf R} pre ktoré platí:\n\n\\begin{displaymath} \\begin{array}{lll} \\hbox{a)}\\ \\vert x\\vert \\leq 4 \\ & \\hbox{... ...vert x+3\\vert <3 & \\hbox{i)}\\ \\vert x-1\\vert \\leq 0 \\end{array}\\end{displaymath}\n\na) \\vert x\\vert \\leq -4; b) \\vert x\\vert  \\geq 2;  c) \\vert x-3\\vert <2;\n\nd) \\vert x-5\\vert <1;   e) \\vert x+1\\vert \\leq 3;  f) \\vert x+\\frac{7}{4}\\vert \\leq \\frac{1}{2};\n\ng) \\vert x-5\\vert > 5; h) \\vert x+3\\vert <3; i) \\vert x-1\\vert <0.\n\nAko možno inak napísať podmienky?\n\na) -1 < x < 1 ; b)  x<-1  alebo  x>1 ?\n\nRiešte nerovnice:\n\na) \\vert x+3\\vert \\leq \\vert x-5\\vert ;\n\nb) \\vert 2x+1\\vert > \\vert x-3\\vert.\n\nRiešte rovnice:\n\n\\begin{displaymath} \\begin{array}{ll} \\hbox{a)} \\ x+\\vert x+3\\vert =5; \\ & \\hbox... ...\\vert =5; \\ & \\hbox{d)} \\ \\vert 5x+1\\vert -2x =-2 . \\end{array}\\end{displaymath}\n\na) x+\\vert x+3\\vert =5;    c) x+\\vert 2x-3\\vert -x =24;\n\nb) x+\\vert x-3\\vert =5;    d) \\vert 5x+1\\vert -2x =-2.\n\nAk platí:  y=\\frac{1}{x} a  \\vert x-4\\vert< 2 , čo môžeme povedať o hodnotách y ?\n\nNájdite všetky čísla x \\in {\\bf R}, ktorých súčet vzdialeností od čísel -3 a 5 a) je menší ako 6; b) je väčší ako 6; c) je rovný 0.","type":"content","url":"/node0016","position":1},{"hierarchy":{"lvl1":"Riešenia cvičení"},"type":"lvl1","url":"/node0017","position":0},{"hierarchy":{"lvl1":"Riešenia cvičení"},"content":"2: iracionálne, racionálne, iracionálne, racionálne, racionálne, iracionálne, racionálne.\n\n3:  \\pi < \\frac{355}{113}<\\frac{22}{7};   \\frac{13}{15} < \\sqrt{7} < \\frac{16}{6};  -1,44 < -\\sqrt{2}<-1,41;  -2,34 < -\\frac{7}{3} < -2,31. \n\n5: nie, nie, nie.\n\n7: a) prienik \\langle 2,3); zjednotenie \\langle -1,\\infty); b) prienik (-4,1\\rangle, zjednotenie  (-7,3); c) prienik (-\\sqrt{123},-1\\rangle, zjednotenie  ( -123,0\\rangle; d) prienik (-8,3\\rangle, zjednotenie  (-\\infty,15).\n\n9:\n\\max {\\rm M}_1 =\\sup{\\rm M}_1 = -1, infimum a minimum neexistujú.\n\n\\sup {\\rm M}_2 =1,\\ \\inf {\\rm M}_2 = 0, maximum a minimum neexistujú.\n\n\\max {\\rm M}_3 =\\sup {\\rm M}_3 = 1, \\inf {\\rm M}_3 =\\min {\\rm M}_3 = 0.\n\n\\sup {\\rm M}_4 = \\sqrt 3, \\inf {\\rm M}_4 =\\sqrt 2, maximum a minimum neexistujú.\n\\inf {\\rm M}_5 =\\min {\\rm M}_5 = -1, supremum a maximum neexistujú.\n\n10:  \\max {\\rm M}=\\sup {\\rm M}=2,  \\min {\\rm M} =\\inf {\\rm M}=0.\n\n11:  \\max {\\rm M}=\\sup {\\rm M}=\\frac{3}{2},  \\inf {\\rm M}=1, minimum neexistuje.\n\n12:  \\sup {\\rm M}=\\frac{2}{9}.\n\n13: \\delta = 0,22 \\%, n=4, plocha =8763 \\pm 2,0.\n\n14: \\delta = 0,16 \\% .\n\n15: a) (4,12); b)  \\langle \\frac{26}{5},7); c)  \\langle-2,0) \\cup \\langle 3,4); d) (-9,-6)\\cup(-3,\\infty); e) (-\\infty,-1\\rangle \\cup \\langle0,1)\\cup(2,\\infty); f) (-\\infty; 2,5)\\cup\\langle 6,\\infty)\n\n16: a)  \\emptyset; b) (-\\sqrt{73}-7; \\sqrt{73}-7); c) (-\\infty, -\\frac{1}{2} \\rangle \\cup \\langle 2,\\infty); d) (0,1)\n\ne) (-\\frac{3}{2},-\\frac{2}{3})\nf) \\langle -\\frac{\\sqrt{46}}{4},\\frac{\\sqrt{46}}{4}\\rangle\n\n17: 5,\\ 24,\\ \\pi-1,\\ 2 \\sqrt{2}-1,\\ 0.\n\n19: a) \\vert x\\vert<1; b)  \\vert x\\vert>1.\n\n20: a) (-\\infty, 1\\rangle;\n\nb) (-\\infty,-4) \\cup (\\frac{2}{3}, \\infty)\n\n21: a) 1; b) 4; c) 27 a -7; d) \\emptyset.\n\n22:  y \\in(\\frac{1}{6}, \\frac{1}{2}).\n\n23: a)  \\emptyset; b) {\\bf R}; c)  \\emptyset.","type":"content","url":"/node0017","position":1},{"hierarchy":{"lvl1":"math.sk/skripta"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"math.sk/skripta"},"content":"","type":"content","url":"/","position":1}]}